Revit 2026 API
CorrectionFactor Methods
The CorrectionFactor type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTemperature |  Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace